app/controllers/promotions_controller.rb

    def create
        @promotion = Promotion.create!(promotion_params)
---
INSERT INTO "promotions" ("keyword", "source", "expdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["keyword", "Free Ship First Order"], ["source", "Weee!"], ["expdate", "2021-11-03 00:00:00"], ["created_at", "2021-11-01 18:39:12.432357"], ["updated_at", "2021-11-01 18:39:12.432357"]]

    def show
        id = params[:id]
        @promotion = Promotion.find(id)
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

    def destroy
        @promotion = Promotion.find(params[:id])
        @promotion.destroy
---
DELETE FROM "promotions" WHERE "promotions"."id" = ?  [["id", 21]]

    def update
        @promotion = Promotion.find params[:id]
        @promotion.update_attributes!(promotion_params)
---
UPDATE "promotions" SET "kind" = ?, "updated_at" = ? WHERE "promotions"."id" = ?  [["kind", "Common"], ["updated_at", "2021-11-02 03:21:59.418686"], ["id", 15]]