app/controllers/promotions_controller.rb

  def index
    @all_categories = Promotion.all_categories
    @categories_to_show = params[:categories] || session[:categories] || {}
    @categories_to_show = Hash[@all_categories.map { |o| [o, '1'] }] if @categories_to_show == {}
    sorting = params[:sort_by] || session[:sort_by] || ''
    @exp_header = 'exp'.eql?(sorting) ? 'hilite bg-warning' : ''

    if (params[:sort_by] != session[:sort_by]) || (params[:categories] != session[:categories])
      session[:sort_by] = sorting
      session[:categories] = @categories_to_show
      redirect_to promotions_path(categories: @categories_to_show, sort_by: sorting) and return
    end

    keys = @categories_to_show.keys
    keys.map { |a| Promotion.categories[a] }
    @promotion = if sorting == ''
                   Promotion.where(category: keys).order(upvotes: :desc)
                 else
                   Promotion.where(category: keys).order(expdate: :desc)
---
SELECT "promotions".* FROM "promotions"
SELECT "promotions".* FROM "promotions" WHERE "promotions"."category" IN (?, ?, ?, ?) ORDER BY "promotions"."upvotes" DESC, 'promotions'.'expdate' DESC  [["category", 2], ["category", 0], ["category", 3], ["category", 1]]
SELECT "promotions".* FROM "promotions" WHERE "promotions"."category" IN (?, ?, ?, ?) ORDER BY "promotions"."expdate" DESC  [["category", 2], ["category", 0], ["category", 3], ["category", 1]]

  def create
    promotion_params['category'] = Promotion.categories[promotion_params['category']]
    @promotion = Promotion.create!(promotion_params)
---
INSERT INTO "promotions" ("keyword", "source", "kind", "expdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["keyword", ""], ["source", ""], ["kind", "New User Only"], ["expdate", "2021-11-01 00:00:00"], ["created_at", "2021-11-01 18:43:21.106742"], ["updated_at", "2021-11-01 18:43:21.106742"]]

  def show
    id = params[:id]
    @promotion = Promotion.find(id)
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @promotion = Promotion.find(params[:id])
    @promotion.destroy
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "promotions" WHERE "promotions"."id" = ?  [["id", 1]]

  def edit
    @promotion = Promotion.find(params[:id])
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def update
    @promotion = Promotion.find params[:id]
    promotion_params['category'] = Promotion.categories[promotion_params['category']]
    @promotion.update_attributes!(promotion_params)
---
SELECT "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "promotions" SET "expdate" = ?, "updated_at" = ? WHERE "promotions"."id" = ?  [["expdate", "2021-11-03"], ["updated_at", "2021-11-03 09:50:17.654811"], ["id", 1]]